init.el
(global-treesit-auto-mode)
(setq treesit-auto-install 'prompt)
(setq treesit-font-lock-level 4)

(setq treesit-language-source-alist
      '((typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
        (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
        (python . ("https://github.com/tree-sitter/tree-sitter-python"))
	  (rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
	  (haskell . ("https://github.com/tree-sitter/tree-sitter-haskell"))
	  ))

(dolist (source treesit-language-source-alist)
  (unless (treesit-ready-p (car source))
    (treesit-install-language-grammar (car source))))

(add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
(add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
(add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode))
(add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))
(add-to-list 'auto-mode-alist '("\\.hs\\'" . haskell-ts-mode))
(add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-ts-mode))



;; Wakatime
(global-wakatime-mode)
;; Make eglot faster with tsserver
(fset #'jsonrpc--log-event #'ignore)
;; corfu
(setq corfu-auto t)
(setq corfu-auto-delay 0)
(setq tcorfu-auto-prefix 1)

;; code blocks
(setq org-confirm-babel-evaluate nil)
(setq org-edit-src-content-indentation 0)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((mermaid . t) (python . t) (shell . t) (C . t) (js . t)))

;; projects
;; Replace shell with ansi-term
(defun project-ansi-term ()
  "Start an ansi-term in the current project's root directory."
  (interactive)
  (let* ((default-directory (project-root (project-current t)))
         (buffer-name (format "%s-term" (project-name (project-current t))))
         (existing-buffer (get-buffer buffer-name)))
    (if existing-buffer
        (switch-to-buffer existing-buffer)
      (ansi-term (getenv "SHELL") buffer-name))))

;; Advice to override project-shell with ansi-term
(defun project-shell-override (orig-fun &rest args)
  "Advice to replace project-shell with ansi-term."
  (project-ansi-term))

;; Apply the advice to project-shell
(advice-add 'project-shell :around #'project-shell-override)


;; general hooks
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)
(add-hook 'prog-mode-hook 'eglot-ensure)
(add-hook 'prog-mode-hook 'corfu-mode)
(add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
(add-hook 'web-mode-hook  'emmet-mode)
(add-hook 'rjsx-mode-hook  'emmet-mode)

(setq ledger-reconcile-default-commodity "GHS")

(defun config-reload ()
  (interactive)
  (load-file user-init-file)) 

(defun zet-search ()
  "Search through Zettelkasten notes in ~/zet using deadgrep while excluding specific files."
  (interactive)
  (let ((zet-dir (expand-file-name "~/zet")))
    ;; Check if directory exists
    (unless (file-directory-p zet-dir)
      (error "Zettelkasten directory ~/zet does not exist"))
    
    ;; Check if ripgrep is installed
    (unless (executable-find "rg")
      (error "ripgrep (rg) is not installed. Please install it first"))

    (let* ((default-directory zet-dir)
           (search-term (read-string "Search zettelkasten for: ")))
      (let ((deadgrep-extra-arguments 
             '("--glob" "!LICENSE" 
               "--glob" "!README.md")))
	(deadgrep search-term default-directory)))))

(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c t") 'ansi-term)
(global-set-key (kbd "C-c r") 'config-reload)
(global-set-key (kbd "C-c z") 'zet-search)
(global-set-key (kbd "M-<f2>") 'modus-themes-toggle) ; toggle light and dark modus themes
(global-set-key (kbd "C-z") 'replace-string)
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "<f8>") 'org-tree-slide-mode)

(add-to-list 'safe-local-variable-values '(eval add-hook 'after-save-hook
	   (lambda nil
	     (if
		 (y-or-n-p "Tangle?")
		 (org-babel-tangle)))
	   nil t))
